<?php

//Проверка, введены ли все числа
if( empty ($_POST['numberA']) ){
    echo 'не введено поле 1! <a href="index.html">Заполните данные еще раз!<br></a>';
       }
if( empty ($_POST['numberB']) ){
    echo 'не введено поле 2! повторите ввод';
}
if( empty ($_POST['numberC']) ){
    echo 'не введено поле 3! повторите ввод';
}
//вывод элементов переменной POST
foreach ($_POST as $key => $value)
echo $key."= ".$value."<br>";

$a = $_POST['numberA'];
$b = $_POST['numberB'];
$c = $_POST['numberC'];

// поиск наименьшего введенного числа
if ($a < $b & $a < $c){
    echo 'Минимальное значение равно:'.$a."<br>";
    }
else {
    if ($b<$c){
        echo 'Минимальное значение равно:'.$b."<br>";
    }
    else {
        echo 'Минимальное значение равно:'.$c."<br>";
    }
}

// поиск наибольшего значения
if ($a > $b & $a > $c){
    echo 'Максимальное значение равно:'.$a."<br>";
}
else {
    if ($b<$c){
        echo 'Максимальное значение равно:'.$c."<br>";
    }
    else {
        echo 'Максимальное значение равно:'.$b."<br>";
    }
}

//сколько чисел больше А
$i = 0;
if ($b > $a){
    $i =1;
}
if ($c > $a){
    $i++;
}
echo "Чисел больше числа А:  $i"."<br>";

//сумма чисел, среднее арифметическое
echo "Сумма чисел равна = ".($a+$b+$c)."<br>";
echo "Среднее арифметическое чисел равно = ".($a+$b+$c)/3;

//кратность 2 и 3
$i = 0;
if ($a % 2 == 0){
$i++;
}
if ($b % 2 == 0){
    $i++;
}
if ($c % 2 == 0){
    $i++;
}
echo "<br> Количество четных чисел равно: $i";


$i = 0;
if ($a % 2 == 0 & $a % 3 == 0){
    $i++;
}
if ($b % 2 == 0 & $b % 3 == 0){
    $i++;
}
if ($c % 2 == 0 & $c % 3 == 0){
    $i++;
}
echo "<br> Количество чисел, которые делятся на 2 и 3 равно: $i";
